{
	"DisplayName": "[Key:LeaderLib:LeaderLib]",
	"Description": "[Key:LeaderLib_Description:LeaderLib is a library mod used to provide common functionality to other mods, as well as providing quality-of-life features for players. Features include a centralized mod menu, autosaving with a customizable interval, dialog redirection, and more.]",
	"Entries": [
		{
			"Text": "See the full changelog in the 'Change Notes' tab on the Steam Workshop page."
		},
		{
			"Version": "1.7.27.0",
			"Changes": [
				"Mod Settings Additions:",
				"\t• Fixed the LeaderLib settings categories missing from the menu.",
				"\t• Added an option to hide the Old Man Lothar to LeaderLib's settings in the Mod Settings UI.",
				"\t• Added options for disabling automatically adding the chain/unchain all and mod menu skills.",
				"Made tooltips skip displaying if the tooltip's target is from Divinity: Original Sin 2, unless that option is enabled in the Gameplay tooltip settings ([Key:LeaderLib_UI_GameSettings_Client_ShowBaseGameModsInTooltips:Show Base Mod Source]).",
				"Fixed a few read-only properties being unnecessarily written."
			]
		},
		{
			"Version": "1.7.26.9",
			"Changes": [
				"Sliders in the Mod Settings menu now default to a more reasonable upper limit if no value is set.",
				"Fixed an error with certain tooltips in GM mode.",
				"Fixed an error when retrieving a mod in the load order fails with the extender. Not sure why this can happen.",
				"Fixed an issue where permanent statuses weren't ignored by the Buff Status Preservation option, resulting in them being removed when your turn ends in combat.",
				"Weapon Expansion Fixes:",
				"\t• Fixed an issue with Balrin's Throwing Axe not being removed when thrown.",
				"\t• Fixed the quantity of loot in the Strange Machine.",
				"\t• Added a name for 'LLWEAPONEX_DEMON_GAUNTLET_BONUS_CRIT_DisplayName'.",
				"\t• Increased Battle Book base damage by 8%.",
				"\t• Fixed certain unique items using the wrong attribute name when increasing resistance values.",
			]
		},
		{
			"Version": "1.7.26.8",
			"Changes": [
				"Fixed a typo that caused GameHelpers.Damage.ApplySkillDamage to not apply the hit status. This may have affected mods using this function/LeaderLib to apply skill damage in scripts.",
				"Added a safeguard when getting [Stat:Attribute] params, to avoid errors if the stat does not exist.",
				"API Changes:",
				"\t• Added GameHelpers.Utils.SetPosition."
			]
		},
		{
			"Version": "1.7.26.7",
			"Changes": [
				"Fixed the '[Key:LeaderLib_AllTooltipsForItemsEnabled:World Tooltips for All Items]' option not working.",
				"API Changes:",
				"\t• Added GameHelpers.Item.IsDestructible.",
				"\t• GameHelpers.Character.GetBaseRace now uses the visual resource first to determine the character's race.",
				"\t• GameHelpers.Damage.ApplySkillDamage can now invoke skill hit listeners."
			]
		},
		{
			"Version": "1.7.26.6",
			"Changes": [
				"Fixed the 'Require Backstab Talent' option preventing backstab settings, even if you have no way to get this talent or disable the option.",
				"\t• The 'Require Backstab Talent' option is now unchecked by default.",
				"Fixed GameHelpers.Item.IsEquipped returning false if the item has no owner, but is equipped.",
				"Fixed the Sadist talent not applying to certain skills (game bug / oversight) if LeaderLib's hit computation is enabled (backstab settings enable this, as well as mods that use the resistance penetration feature, or 'Enable Spell Critical Hits' in Gameplay Settings).",
				"Fixed an issue in Weapon Expansion where certain uniques weren't swapping.",
				"Skipped redirecting dialog if it's from a 'God' in certain story scenarios.",
				"Skipped checking skill requirements for actions.",
				"API Changes:",
				"\t• Added Events.CharacterUsedItem, Events.RuneChanged, and GameHelpers.Item.GetRunes.",
				"\t• Added Events.RebuildVisuals, GameHelpers.Character.GetRace, and GameHelpers.Character.GetGender."
			]
		},
		{
			"Version": "1.7.26.5",
			"Changes": [
				"Fixed the !modorder console window command.",
				"Added 'Keep Tooltip in Screen' to the gameplay client tooltip options. This option will prevent the tooltip from going off the screen (thanks to Pip for the suggestion).",
				"Fix options/mod settings UI issues in controller mode:",
				"\t• Fixed an issue where the 'Mod Settings' menu button was missing from the UI.",
				"\t• Fixed label font size and positioning.",
				"\t• Buttons display names are now capped, and their name is displayed in the tooltip, due to the button width itself being limited.",
				"\t• Fixed additional buttons in the Gameplay menu (missing name/tooltip).",
				"API Changes:",
				"\t• Fixed Events.SummonChanged not firing.",
				"\t• Added GameHelpers.Character.SetEquipment, GameHelpers.Character.SetStats.",
				"\t• Classes.ContextMenuAction can now open in the regular context menu if 'AutomaticallyAddToBuiltin' is set.",
				"v57 (Upcoming) Changes:",
				"\t• Added 'Show Mod Source' to gameplay client tooltip options, allowing item/status/skill tooltips to show the mod it comes from.",
				"\t• Fixed an issue with RawInput. The shift key specifically is now checked, to expand/contract tooltips (before we could only look for supported keybindings)."
			]
		},
		{
			"Version": "1.7.26.4",
			"Changes": [
				"Fixed an issue preventing combat if 'Auto-Identify Items' was enabled. Turns out the game property 'AutoIdentifyItems' actually prevents combat? Really weird.",
				"Made the combat sight range setting slider increment by 0.5, so it's possible to reset it to default (2.5).",
				"API Changes:",
				"\t• Added GameHelpers.Character.EquipmentHasSkill and GameHelpers.Item.GetEquippedSkills.",
				"\t• Classes.UIWrappers now has a Register subtable, with function that pass the event object.",
				"\t• Added Features.FixTooltipEmptySkillProperties, for automatically removing empty skill property text from skill tooltips."
			]
		},
		{
			"Version": "1.7.26.3",
			"Changes": [
				"Fixed an issue where talent tooltips could potentially crash when delayed.",
				"API Changes:",
				"\t• SKILLSTATE.LEARNED events now fire when a skill is unmemorized and is removed (unlearned)",
				"\t• The base leave action projectile skills now have some default forking conditions",
				"\t• Fetching an object by GUID is now skipped if that GUID is a null GUID value (avoids some extender warning text).",
				"\t• Added new developer commands when right clicking characters: Make Hostile, Enter Combat, Exit Combat."
			]
		},
		{
			"Version": "1.7.26.2",
			"Changes": [
				"Fixed an issue where status tooltips may have stopped showing on hover, if the tooltip request was getting spammed (statuses with durations).",
				"Added support for status panel status tooltips in GM mode."
			]
		},
		{
			"Version": "1.7.26.1",
			"Changes": [
				"Fixed an issue where Client Gameplay settings were being reset to default values (the actual problem being they weren't loaded once initially).",
				"Fixed an issue where text with a tooltip in the options menu may have prevented clicking on a checkbox/element below.",
				"Fixed an issue where labels in the options menu, that have tooltips, wouldn't hide the tooltip when the mouse stops hovering over them."
			]
		},
		{
			"Version": "1.7.26.0",
			"Changes": [
				"Fixed an issue where client gameplay settings were being reset to the host's settings in multiplayer.",
				"Fixed an issue where mods registering status listeners for engine statuses wasn't working correctly.",
				"Made the Mod Settings and Gameplay settings refresh if host settings are synced in multiplayer, if the menu is already open.",
				"Added a new feature: If LeaderLib_StatChanges.json exists in the 'Documents/Larian Studios/Divinity Original Sin 2 Definitive Edition/Osiris Data', this file will be loaded and will apply stat changes automatically."
			]
		},
		{
			"Version": "1.7.25.3",
			"Changes": [
				"Fixed an issue where the 'Scales With' text wasn't being shown in weapon tooltips.",
				"Added a workaround for an obscure game/extender bug, where the last tooltip element in a status tooltip was being duplicated, if a status with a duration is active outside of combat, and a mod adds a toolip element."
			]
		},
		{
			"Version": "1.7.25.2",
			"Changes": [
				"Fixed an issue where Spirit Vision no longer applied a status. Turns out this is an obscure extender bug, so a workaround was added until it can be fixed in the extender itself (the workaround makes the bug not occur)."
			]
		},
		{
			"Version": "1.7.25.1",
			"Changes": [
				"Fixed an issue where heal type statuses were being blocked."
			]
		},
		{
			"Version": "1.7.25.0",
			"Changes": [
				"Made the in-game Mod Menu no longer uncheck active mods that have been updated.",
				"Made the Options menu restore the last tab opened, instead of always defaulting to the Graphics menu.",
				"Added new Quality of Life options to the \"Mod Settings\" menu:",
				"\t• Auto-identify Items",
				"\t• Permanent Spirit Vision (lets you toggle it on/off)",
				"\t• Base Carry Weight Overriding",
				"\t• Show Consumable Effects (Globally) - Allows displaying potion/food/drink/ingredient effects without consuming the item beforehand<br>",
				"Added new Quality of Life options to the \"Gameplay\" menu, in the Client section:",
				"\t• Added \"Show Consumable Effects\" (enabled by default), allowing you to hide consumable effects if the global setting 'Show Consumable Effects' is enabled. The global setting must be enabled for this option to have an effect.",
				"\t• Added \"Show Status Source\" (enabled by default). Statuses now display their source object (character or item) in the tooltip, but unchecking this will hide that information once more.",
				"\t• Added \"Delay Override\", allowing you to override the tooltip delay for tooltips that have delay enabled.",
				"\t• Added \"Always Show Bar Values\", which will allow the vitality and armor bars to always show their numbers<br>",
				"Added several tweaks to the Info section of the journal:",
				"\t• The text can now scroll.",
				"\t• Mod Changes has been moved up to the top of the category sidebar.",
				"\t• Info categories are now sorted alphabetically.",
				"\t• Mod entries in Mod Changes may have description tooltips now.",
				"\t• The text area has been widened and adjusted slightly.",
				"\t• The last info entry selected will not be re-selected when opening the Info tab again.<br>",
				"These journal changes will only work if the journal UI isn't already overwritten, otherwise LeaderLib's UI override will be skipped."
			]
		},
		{
			"Version": "1.7.24.2",
			"Changes": [
				"Fixed an issue with item tooltips if Improved Hotbars is enabled (may be fixed in Improved Hotbars as well)."
			]
		},
		{
			"Version": "1.7.24.1",
			"Changes": [
				"Fixed an issue preventing the Buff Status Preservation feature from working."
			]
		},
		{
			"Version": "1.7.24.0",
			"Changes": [
				"Added new options to allow fading out items in the inventory (read books, known skillbooks)."
			]
		},
		{
			"Version": "1.7.22.4",
			"Changes": [
				"Added an option to initially enable the combat log."
			]
		},
		{
			"Version": "1.7.22.3",
			"Changes": [
				"Fixed various tooltip-related issues in controller mode."
			]
		},
		{
			"Version": "1.7.22.2",
			"Changes": [
				"Fixed an issue preventing buff statuses from being preserved."
			]
		},
		{
			"Version": "1.7.22.1",
			"Changes": [
				"Fixed an issue where condensed item tooltips weren't displaying chances for \"On Hit\" bonuses.",
				"Fix client-side settings being greyed out in multiplayer."
			]
		},
		{
			"Version": "1.7.22.0",
			"Changes": [
				"Added new tooltip options in the Gameplay menu.",
				"Buff status preservation now only works on buffs applied by skills.",
				"Fixed an error when checking item tooltips as a GM, when not possessing a character."
			]
		}
	]
}